#+TITLE: Ma configuration Emacs
#+HTML_HEAD_EXTRA: <style>pre { background-color: #282c34 ; color: #bbc2cf }</style>
** Indentation
#+begin_src emacs-lisp :tangle yes
  (use-package aggressive-indent
      :ensure t)
  (global-aggressive-indent-mode 1)
  (add-to-list 'aggressive-indent-excluded-modes 'html-mode)
#+end_src

#+RESULTS:
| html-mode | bibtex-mode | cider-repl-mode | coffee-mode | comint-mode | conf-mode | Custom-mode | diff-mode | doc-view-mode | dos-mode | erc-mode | feature-mode | fortran-mode | f90-mode | jabber-chat-mode | haml-mode | haskell-mode | haskell-interactive-mode | image-mode | inf-ruby-mode | makefile-mode | makefile-gmake-mode | minibuffer-inactive-mode | netcmd-mode | python-mode | sass-mode | scala-mode | slim-mode | special-mode | shell-mode | snippet-mode | eshell-mode | tabulated-list-mode | term-mode | TeX-output-mode | text-mode | yaml-mode |

aggressive indent ne fonctionne pas avec python, on peut l'activer,
mais cela ne fonctionne pas super bien. J'ai donc retiré le code
suivant de ma config.
#+begin_src emacs-lisp :tangle no
  (add-hook 'after-change-major-mode-hook (lambda() (electric-indent-mode -1)))
  (setq aggressive-indent-excluded-modes
	(remove 'python-mode aggressive-indent-excluded-modes))
#+end_src

#+RESULTS:
| html-mode | bibtex-mode | cider-repl-mode | coffee-mode | comint-mode | conf-mode | Custom-mode | diff-mode | doc-view-mode | dos-mode | erc-mode | feature-mode | fortran-mode | f90-mode | jabber-chat-mode | haml-mode | haskell-mode | haskell-interactive-mode | image-mode | inf-ruby-mode | makefile-mode | makefile-gmake-mode | minibuffer-inactive-mode | netcmd-mode | sass-mode | scala-mode | slim-mode | special-mode | shell-mode | snippet-mode | eshell-mode | tabulated-list-mode | term-mode | TeX-output-mode | text-mode | yaml-mode |

